package puzikov.jse.geekbrains;
//Создать массив с набором слов (10-20 слов,
// должны встречаться повторяющиеся). Найти
// и вывести список уникальных слов, из которых
// состоит массив (дубликаты не считаем).
// Посчитать, сколько раз встречается каждое слово.
//        Написать простой класс Телефонный
//        Справочник, который хранит в себе
//        список фамилий и телефонных номеров.
//        В этот телефонный справочник с
//        помощью метода add() можно добавлять
//        записи, а с помощью метода get() и
//        скать номер телефона по фамилии.
//        Следует учесть, что под одной фамилией
//        может быть несколько телефонов
//        (в случае однофамильцев), тогда при запросе
//        такой фамилии должны выводиться все телефоны.
//        Желательно не добавлять лишний функционал
//        (дополнительные поля (имя, отчество, адрес),
//        взаимодействие с пользователем через консоль и т.д).
//        Консоль использовать только для вывода
//        результатов проверки телефонного справочника.

import java.util.ArrayList;
import java.util.HashMap;

class MainLesson3 {
    public static void main(String[] args) {
        System.out.println("Work Part_1:");
        Part1 part1 = new Part1();
        part1.part1();

    }
}
